app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("user_id", "voyage_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["voyage_id", 1], ["created_at", "2020-08-22 13:06:53.654773"], ["updated_at", "2020-08-22 13:06:53.654773"]]

  def destroy
    @reservation.destroy
---
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 3]]