app/controllers/voyages_controller.rb

  def index
    @voyages = Voyage.all
---
SELECT "voyages".* FROM "voyages"

  def show
    @voyage = Voyage.find(params[:id])
     unless @reservation = Reservation.find(@voyage.id)
---
SELECT "voyages".* FROM "voyages" WHERE "voyages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @voyage = Voyage.new(voyage_params)

    respond_to do |format|
      if @voyage.save
---
INSERT INTO "voyages" ("destination", "depart", "date_depart", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["destination", "majunga"], ["depart", "tana"], ["date_depart", "2020-08-22 13:17:00"], ["created_at", "2020-08-22 13:17:38.530119"], ["updated_at", "2020-08-22 13:17:38.530119"]]

    def set_voyage
      @voyage = Voyage.find(params[:id])
---
SELECT "voyages".* FROM "voyages" WHERE "voyages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]